rating = int(input("Введите рейтинг продукта (1-10): "))

match rating:
    case 1 | 2 | 3:
        print(f"Рейтинг {rating} -> Плохой продукт 💩 Не рекомендую!")
    case 4 | 5 | 6:
        print(f"Рейтинг {rating} -> Средний продукт 😐 Можно попробовать!")
    case 7 | 8 | 9:
        print(f"Рейтинг {rating} -> Хороший продукт 😊 Рекомендую!")
    case 10:
        print(f"Рейтинг {rating} -> Отличный продукт 💦 Вам надо это попробовать!")
    case _:
        print("Данный рейтинг вне допустимых значений!")